MT/cfd_sim/cases/case1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue A 0
    volScalarFieldValue B 0
);

regions
(
    boxToCell
    {
        box (0 0 0.45) (0.1 0.1 0.55);

        fieldValues
        (
            volScalarFieldValue A 5
            volScalarFieldValue B  0
        );
    }
);

// ************************************************************************* //
